<template>
    <div style="font-size: 16px">
      <h3 style="text-align: center">店铺注册协议</h3>

      尊敬的用户，欢迎您注册乐享科技店铺账号。在访问和使用乐享科技系统的同时，也请您仔细阅读我们的协议条款。您需要完全接受本协议才能注册成为我们的店铺用户。一经注册，即视为同意本协议中的所有条款内容，需要遵守协议中的所有条款。

      以下的条款作为店铺在使用乐享科技服务时与乐享科技达成的协议约定。

      一、服务内容

      1.1、您上传的身份证、营业执照、店铺场内照片等内容是您授权乐享科技帮助您传递给第三方支付宝和微信，用于第三方为您提供服务。

      1.2、您可以利用乐享科技平台提供的技术软件服务进行收单，并获得广告流量费用。

      1.3、您在乐享科技上传信息资料时，应首先进行自查，确保填写和上传的资料正确。一旦您在乐享科技上传了错误信息导致您与第三方签约失败以及收款失败等情况，一切后果皆由您自己承担。您提交完成操作即视为您已经经进行自查。

      二、隐私保护
      1、乐享科技向您保证不对外公开或向第三方提供您的注册资料及您在使用本系统服务时存储在本系统的非公开内容，但下列情况除外：1.事先获得您的明确授权的；2.根据有关的法律法规要求，我们必须提供的；3.按照相关政府主管部门的要求，我们必须提供的；4，您先行违反本协议内容导致乐享科技或第三方或者社会公共利益受损或者受到威胁的，我们有权向相关当事人提供您的相关信息。

      2、用户知悉并认可：乐享科技可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本网站同等的保护用户隐私的责任，则乐享科技有权将用户的注册资料等提供给该第三方。另外，在不透露单个用户隐私资料的前提下，乐享科技有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。

      3、如果用户发现个人信息被盗用，或者用户的版权或者其他权利被侵害，请将此情况告知乐享科技并同时提供如下信息和材料：

      （1）侵犯您权利的信息的网址，编号或其它可以找到该信息的细节；您保证您是所述的信息是真实有效而且现实存在的；

      （2）版权或个人信息的合法拥有者的声明；

      （3）您的联系方式，包括联系人姓名，地址，电话号码和电子邮件；

      （4）您的身份证复印件、营业执照等。

      4、用户应确保您自己账号和密码的安全，因用户自己的过失导致损害发生的，乐享科技不承担任何责任。

      三、免责条款
      1、鉴于乐享科技仅作为店铺进行交易的技术服务平台，并非资料的提供者和上传者；店铺提供的资料和代理商上传的资料，乐享科技无法判断信息的真实性，因此乐享科技无法保证其内容的真实性、准确性、有效性和安全性。因此，用户确认在使用本网站所提供的服务前，用户已经知晓，理解并认可此情况。用户在使用非乐享科技自行上传的内容时遭受的损失和其它一切后果由用户独自承担。

      2、包括但不限于当因为不可抗力、来自外部的恶意网络攻击或其它非本网站故意行为导致乐享科技不能顺畅提供服务时，乐享科技不承担任何责任，也不用提供任何补偿。

      3、根据法律规定、相关协议约定，乐享科技不承担责任的其他情形。

      四、法律声明
      本协议在所有方面均受中华人民共和国法律管辖。本协议的规定是可分割的，如本协议的任何规定被裁定为无效或不可执行，该规定可被删除而其余条款继续有效并应予以执行。用户同意，在发生并购，本协议和所有纳入的协议可由乐享科技按本公司自行酌情决定向第三方自动转让。本公司未就用户或其他方的违约采取行动并不等于本公司放弃就随后或类似的违约采取行动的权利。

    </div>
</template>

<script>
    export default {
        name: "userRegistrationAgreement"
    }
</script>

<style scoped>

</style>
